/** @type {import('tailwindcss').Config} */
export default {
  content: ["./index.html", "./src/**/*.{vue,js,ts,jsx,tsx}"],
  theme: {
    extend: {
      colors: {
        //修改tailwind配置，可以在內聯使用
        primary: {
          50: '#F2FBF3',
          100: '#E2F6E5',
          200: '#C5EDCA',
          300: '#98DDA2',
          400: '#58C067',
          500: '#3EA94D',
          600: '#2E8B3B',
          700: '#286D33',
          800: '#24572C',
          900: '#1F4826',
          950: '#0C2711'
        },
        secondary: {
          50: "#fbf8f1",
          100: "#f5eedf",
          200: "#ebdbbd",
          300: "#ddc194",
          400: "#d5ad7b",
          500: "#c5894a",
          600: "#b7753f",
          700: "#985d36",
          800: " #7b4c31",
          900: "#643f2a",
          950: " #351f15",
        },
        tertiary: {
          50: "#fefee7",
          100: "#fcfccb",
          200: "#f6f89e",
          300: "#ebf165",
          400: "#dce536",
          500: "#c3d018",
          600: "#95a20e",
          700: "#707b10",
          800: "#586113",
          900: "#4a5314",
          950: "#272e05",
        },
        errpr: {
          50: "fef2f2",
          100: "fee3e2",
          200: "feccca",
          300: "fca8a5",
          400: "f87671",
          500: "ef4b44",
          600: "de3730",
          700: "b9221c",
          800: "99201b",
          900: "7f211d",
          950: "450c0a",
        },
        neutral: {
          50: "#ffffff",
          100: "#efefef",
          200: "#dcdcdc",
          300: "#dbdbdb",
          400: "#989898",
          500: "#7c7c7c",
          600: "#656565",
          700: "#525252",
          800: "#464646",
          900: "#3d3d3d",
          950: "#292929",
        }
      }
    },
  },
  plugins: [],
}

